{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "vocab": {
      "[UNK]": 0,
      "<pad>": 1,
      "</s>": 2,
      "0": 3,
      "1": 4,
      "2": 5,
      "3": 6,
      "4": 7,
      "5": 8,
      "6": 9,
      "7": 10,
      "8": 11,
      "9": 12,
      "a": 13,
      "b": 14,
      "c": 15,
      "d": 16,
      "e": 17,
      "f": 18,
      "20": 19,
      "4f": 20,
      "80": 21,
      "52": 22,
      "61": 23,
      "57": 24,
      "81": 25,
      "4b": 26,
      "6e": 27,
      "82": 28,
      "e5": 29,
      "69": 30,
      "65": 31,
      "74": 32,
      "4a": 33,
      "cc": 34,
      "83": 35,
      "84": 36,
      "6f": 37,
      "68": 38,
      "89": 39,
      "0a": 40,
      "b8": 41,
      "8c": 42,
      "73": 43,
      "41": 44,
      "e6": 45,
      "8b": 46,
      "85": 47,
      "87": 48,
      "8d": 49,
      "8a": 50,
      "bc": 51,
      "86": 52,
      "88": 53,
      "94": 54,
      "75": 55,
      "8e": 56,
      "90": 57,
      "99": 58,
      "97": 59,
      "93": 60,
      "64": 61,
      "e7": 62,
      "8f": 63,
      "91": 64,
      "96": 65,
      "9c": 66,
      "ba": 67,
      "67": 68,
      "a3": 69,
      "9b": 70,
      "72": 71,
      "9a": 72,
      "ae": 73,
      "2c": 74,
      "95": 75,
      "e4": 76,
      "98": 77,
      "9e": 78,
      "a4": 79,
      "9f": 80,
      "b9": 81,
      "af": 82,
      "63": 83,
      "92": 84,
      "bb": 85,
      "6d": 86,
      "2e": 87,
      "a5": 88,
      "a7": 89,
      "a9": 90,
      "b0": 91,
      "a8": 92,
      "b4": 93,
      "e8": 94,
      "e1": 95,
      "53": 96,
      "a6": 97,
      "ad": 98,
      "bd": 99,
      "a1": 100,
      "be": 101,
      "9d": 102,
      "47": 103,
      "e0": 104,
      "6c": 105,
      "6b": 106,
      "a0": 107,
      "a2": 108,
      "b2": 109,
      "b1": 110,
      "b3": 111,
      "b6": 112,
      "ab": 113,
      "b7": 114,
      "79": 115,
      "ac": 116,
      "e9": 117,
      "b5": 118,
      "62": 119,
      "aa": 120,
      "31": 121,
      "70": 122,
      "ef": 123,
      "e2": 124,
      "30": 125,
      "76": 126,
      "e3": 127,
      "32": 128,
      "66": 129,
      "39": 130,
      "29": 131,
      "28": 132,
      "77": 133,
      "2d": 134,
      "c4": 135,
      "bf": 136,
      "35": 137,
      "38": 138,
      "33": 139,
      "50": 140,
      "34": 141,
      "22": 142,
      "37": 143,
      "43": 144,
      "36": 145,
      "6a": 146,
      "42": 147,
      "3a": 148,
      "78": 149,
      "71": 150,
      "c2": 151,
      "27": 152,
      "58": 153,
      "7a": 154,
      "3b": 155,
      "7c": 156,
      "2f": 157,
      "25": 158,
      "3d": 159,
      "09": 160,
      "5d": 161,
      "5b": 162,
      "2b": 163,
      "21": 164,
      "26": 165,
      "3f": 166,
      "3e": 167,
      "7d": 168,
      "7b": 169,
      "3c": 170,
      "2a": 171,
      "24": 172,
      "4c": 173,
      "d9": 174,
      "23": 175,
      "54": 176,
      "ce": 177,
      "4d": 178,
      "5f": 179,
      "c3": 180,
      "d8": 181,
      "cf": 182,
      "4e": 183,
      "d0": 184,
      "7e": 185,
      "ca": 186,
      "d7": 187,
      "d1": 188,
      "45": 189,
      "c9": 190,
      "48": 191,
      "55": 192,
      "cb": 193,
      "60": 194,
      "56": 195,
      "da": 196,
      "40": 197,
      "44": 198,
      "c5": 199,
      "f0": 200,
      "5c": 201,
      "5e": 202,
      "ea": 203,
      "d6": 204,
      "db": 205,
      "cd": 206,
      "46": 207,
      "dd": 208,
      "dc": 209,
      "51": 210,
      "c6": 211,
      "df": 212,
      "de": 213,
      "d2": 214,
      "d5": 215,
      "d3": 216,
      "c7": 217,
      "c8": 218,
      "ee": 219,
      "d4": 220,
      "49": 221,
      "7f": 222,
      "f3": 223
    },
    "merges": [
      "2 0",
      "4 f",
      "8 0",
      "5 2",
      "6 1",
      "5 7",
      "8 1",
      "4 b",
      "6 e",
      "8 2",
      "e 5",
      "6 9",
      "6 5",
      "7 4",
      "4 a",
      "c c",
      "8 3",
      "8 4",
      "6 f",
      "6 8",
      "8 9",
      "0 a",
      "b 8",
      "8 c",
      "7 3",
      "4 1",
      "e 6",
      "8 b",
      "8 5",
      "8 7",
      "8 d",
      "8 a",
      "b c",
      "8 6",
      "8 8",
      "9 4",
      "7 5",
      "8 e",
      "9 0",
      "9 9",
      "9 7",
      "9 3",
      "6 4",
      "e 7",
      "8 f",
      "9 1",
      "9 6",
      "9 c",
      "b a",
      "6 7",
      "a 3",
      "9 b",
      "7 2",
      "9 a",
      "a e",
      "2 c",
      "9 5",
      "e 4",
      "9 8",
      "9 e",
      "a 4",
      "9 f",
      "b 9",
      "a f",
      "6 3",
      "9 2",
      "b b",
      "6 d",
      "2 e",
      "a 5",
      "a 7",
      "a 9",
      "b 0",
      "a 8",
      "b 4",
      "e 8",
      "e 1",
      "5 3",
      "a 6",
      "a d",
      "b d",
      "a 1",
      "b e",
      "9 d",
      "4 7",
      "e 0",
      "6 c",
      "6 b",
      "a 0",
      "a 2",
      "b 2",
      "b 1",
      "b 3",
      "b 6",
      "a b",
      "b 7",
      "7 9",
      "a c",
      "e 9",
      "b 5",
      "6 2",
      "a a",
      "3 1",
      "7 0",
      "e f",
      "e 2",
      "3 0",
      "7 6",
      "e 3",
      "3 2",
      "6 6",
      "3 9",
      "2 9",
      "2 8",
      "7 7",
      "2 d",
      "c 4",
      "b f",
      "3 5",
      "3 8",
      "3 3",
      "5 0",
      "3 4",
      "2 2",
      "3 7",
      "4 3",
      "3 6",
      "6 a",
      "4 2",
      "3 a",
      "7 8",
      "7 1",
      "c 2",
      "2 7",
      "5 8",
      "7 a",
      "3 b",
      "7 c",
      "2 f",
      "2 5",
      "3 d",
      "0 9",
      "5 d",
      "5 b",
      "2 b",
      "2 1",
      "2 6",
      "3 f",
      "3 e",
      "7 d",
      "7 b",
      "3 c",
      "2 a",
      "2 4",
      "4 c",
      "d 9",
      "2 3",
      "5 4",
      "c e",
      "4 d",
      "5 f",
      "c 3",
      "d 8",
      "c f",
      "4 e",
      "d 0",
      "7 e",
      "c a",
      "d 7",
      "d 1",
      "4 5",
      "c 9",
      "4 8",
      "5 5",
      "c b",
      "6 0",
      "5 6",
      "d a",
      "4 0",
      "4 4",
      "c 5",
      "f 0",
      "5 c",
      "5 e",
      "e a",
      "d 6",
      "d b",
      "c d",
      "4 6",
      "d d",
      "d c",
      "5 1",
      "c 6",
      "d f",
      "d e",
      "d 2",
      "d 5",
      "d 3",
      "c 7",
      "c 8",
      "e e",
      "d 4",
      "4 9",
      "7 f",
      "f 3"
    ]
  }
}